$(function ($) {
	//弹出登录
	$("#example").hover(function () {
		$(this).stop().animate({
			opacity: '1'
		}, 600);
	}, function () {
		$(this).stop().animate({
			opacity: '0.6'
		}, 1000);
	}).on('click', function () {
		$("body").append("<div id='mask'></div>");
		$("#mask").addClass("mask").fadeIn("slow");
		$("#LoginBox").fadeIn("slow");
	});
	//
	//按钮的透明度
	$("#loginbtn").hover(function () {
		$(this).stop().animate({
			opacity: '1'
		}, 600);
	}, function () {
		$(this).stop().animate({
			opacity: '0.8'
		}, 1000);
	});
	//文本框不允许为空---按钮触发
	$("#loginbtn").on('click', function () {
		var txtName = $("#txtName").val();
		var txtPwd = $("#txtPwd").val();
		if (txtName == "" || txtName == undefined || txtName == null) {
			if (txtPwd == "" || txtPwd == undefined || txtPwd == null) {
				$(".warning").css({ display: 'block' });
			}
			else {
				$("#warn").css({ display: 'block' });
				$("#warn2").css({ display: 'none' });
			}
		}
		else {
			if (txtPwd == "" || txtPwd == undefined || txtPwd == null) {
				$("#warn").css({ display: 'none' });
				$(".warn2").css({ display: 'block' });
			}
			else {
				$(".warning").css({ display: 'none' });
			}
		}
	});
	//文本框不允许为空---单个文本触发
	$("#txtName").on('blur', function () {
		var txtName = $("#txtName").val();
		if (txtName == "" || txtName == undefined || txtName == null) {
			$("#warn").css({ display: 'block' });
		}
		else {
			$("#warn").css({ display: 'none' });
		}
	});
	$("#txtName").on('focus', function () {
		$("#warn").css({ display: 'none' });
	});
	//
	$("#txtPwd").on('blur', function () {
		var txtName = $("#txtPwd").val();
		if (txtName == "" || txtName == undefined || txtName == null) {
			$("#warn2").css({ display: 'block' });
		}
		else {
			$("#warn2").css({ display: 'none' });
		}
	});
	$("#txtPwd").on('focus', function () {
		$("#warn2").css({ display: 'none' });
	});
	//关闭
	$(".close_btn").hover(function () { $(this).css({ color: 'black' }) }, function () { $(this).css({ color: '#999' }) }).on('click', function () {
		$("#LoginBox").fadeOut("fast");
		$("#mask").css({ display: 'none' });
	});
});


[
{'编号':'GG3','名称':'无缝钢管','规格':'D32×3.5','产地':'国产/米','造价':98,},
{'编号':'GG4','名称':'无缝钢管','规格':'D45×3.5','产地':'国产/米','造价':285,},
{'编号':'GG5','名称':'无缝钢管','规格':'D57×3.5','产地':'国产/米','造价':304,},
{'编号':'GG7','名称':'无缝钢管','规格':'D76×4.0','产地':'国产/米','造价':330,},
{'编号':'GG8','名称':'无缝钢管','规格':'D89×4.5','产地':'国产/米','造价':375,},
{'编号':'GG10','名称':'无缝钢管','规格':'D108×5','产地':'国产/米','造价':514,},
{'编号':'GG13','名称':'无缝钢管','规格':'D133×5','产地':'国产/米','造价':0,},
{'编号':'GG15','名称':'无缝钢管','规格':'D159×5','产地':'国产/米','造价':644,},
{'编号':'GG21','名称':'螺旋钢管','规格':'D219×6','产地':'国产/米','造价':769,},
{'编号':'GG27','名称':'螺旋钢管','规格':'D273×6','产地':'国产/米','造价':880,},
{'编号':'GG32','名称':'螺旋钢管','规格':'D325×6','产地':'国产/米','造价':998,},
{'编号':'GG37','名称':'螺旋钢管','规格':'D377×6','产地':'国产/米','造价':0,},
{'编号':'GG42','名称':'螺旋钢管','规格':'D426×7','产地':'国产/米','造价':1236,},
{'编号':'GG52','名称':'螺旋钢管','规格':'D529×7','产地':'国产/米','造价':1496,},
{'编号':'GG63','名称':'螺旋钢管','规格':'D630×8','产地':'国产/米','造价':1769,},
{'编号':'GG72','名称':'螺旋钢管','规格':'D720×8','产地':'国产/米','造价':0,},

{'编号':'GS4','名称':'塑料管','规格':'D40×3.7','产地':'国产/米','造价':319,},
{'编号':'GS6','名称':'塑料管','规格':'D63×5.7','产地':'国产/米','造价':310,},
{'编号':'GS9','名称':'塑料管','规格':'D90×8.2','产地':'国产/米','造价':331,},
{'编号':'GS11','名称':'塑料管','规格':'D110×10.0','产地':'国产/米','造价':459,},
{'编号':'GS16','名称':'塑料管','规格':'D160×14.6','产地':'国产/米','造价':601,},
{'编号':'GS20','名称':'塑料管','规格':'D200×18.2','产地':'国产/米','造价':653,},
{'编号':'GS25','名称':'塑料管','规格':'D250×22.7','产地':'国产/米','造价':766,},
{'编号':'GS30','名称':'塑料管','规格':'D315×28.6','产地':'国产/米','造价':932,},
{'编号':'GS35','名称':'塑料管','规格':'D355×32.3','产地':'国产/米','造价':1025,},
{'编号':'GS40','名称':'塑料管','规格':'D400×36.4','产地':'国产/米','造价':1186,},

{'编号':'FR5','名称':'人行道阀门井','规格':'DN50','产地':'国产/座','造价':4840,},
{'编号':'FR6','名称':'人行道阀门井','规格':'DN65','产地':'国产/座','造价':5770,},
{'编号':'FR8','名称':'人行道阀门井','规格':'DN80','产地':'国产/座','造价':6564,},
{'编号':'FR10','名称':'人行道阀门井','规格':'DN100','产地':'国产/座','造价':7269,},
{'编号':'FC5','名称':'车行道阀门井','规格':'DN50','产地':'国产/座','造价':4840,},
{'编号':'FC6','名称':'车行道阀门井','规格':'DN65','产地':'国产/座','造价':5770,},
{'编号':'FC8','名称':'车行道阀门井','规格':'DN80','产地':'国产/座','造价':6564,},
{'编号':'FC10','名称':'车行道阀门井','规格':'DN100','产地':'国产/座','造价':7269,},
{'编号':'FC12','名称':'车行道阀门井','规格':'DN125','产地':'国产/座','造价':0,},
{'编号':'FC15','名称':'车行道阀门井','规格':'DN150','产地':'国产/座','造价':11311,},
{'编号':'FC20','名称':'车行道阀门井','规格':'DN200','产地':'国产/座','造价':16422,},
{'编号':'FC25','名称':'车行道阀门井','规格':'DN250','产地':'国产/座','造价':25365,},
{'编号':'FC30','名称':'车行道阀门井','规格':'DN300','产地':'国产/座','造价':30430,},
{'编号':'FC35','名称':'车行道阀门井','规格':'DN350','产地':'国产/座','造价':0,},
{'编号':'FC40','名称':'车行道阀门井','规格':'DN400','产地':'国产/座','造价':59407,},
{'编号':'FC50','名称':'车行道阀门井','规格':'DN500','产地':'国产/座','造价':82422,},
{'编号':'FC60','名称':'车行道阀门井','规格':'DN600','产地':'国产/座','造价':0,},
{'编号':'FC70','名称':'车行道阀门井','规格':'DN700','产地':'国产/座','造价':0,},

{'编号':'TX-100','名称':'调压箱','规格':'RTZ-21/15  100Q','产地':'彗星/台','造价':4617,},
{'编号':'TG-300','名称':'调压柜','规格':'RX300/0.4C-FJ/F','产地':'久安/台','造价':41044,},
{'编号':'TG-500','名称':'调压柜','规格':'RX500/0.4C-FJ/F','产地':'久安/台','造价':46764,},
{'编号':'TG-800','名称':'调压柜','规格':'RX800/0.4C-FJ/F','产地':'久安/台','造价':53116,},
{'编号':'TG-1000','名称':'调压柜','规格':'RX1000/0.4C-FJ/F','产地':'久安/台','造价':66659,},
{'编号':'TG-1200','名称':'调压柜','规格':'RX1200/0.4C-FJ/F','产地':'久安/台','造价':67229,},
{'编号':'TG-1500','名称':'调压柜','规格':'RX1500/0.4C-FJ/F','产地':'久安/台','造价':108113,},
{'编号':'TG-2000','名称':'调压柜','规格':'RX2000/0.4C-FJ/F','产地':'久安/台','造价':139823,},
{'编号':'TG-2500','名称':'调压柜','规格':'RX2500/0.4C-FJ/F','产地':'久安/台','造价':161348,},

]
[
'唐斌',
'卞淞霖',
'杨青',
'孙立雪',
'杨建瑜',
'梁月作',
'吕健驰',
'刘瑛璐',
'张秋华',
'陈新建',
'王睿',
'张磊',
'李娜',
'曾海武',
'陈文洋',
'黄烈旭',
'谢维',
'赵佳',
'杨英杰',
'陈嘉',
'邓勇',
'伍景胜',
'陆著飞',
'陈立汶',
'李加新',
'张健明',
'吴欣颖',
'冀顶飞',
'田文龙',
'周健',
'杜泽凤',
]